# Synthesis script for yosys created by qflow
# Map register flops
dfflibmap -liberty /usr/local/share/qflow/tech/osu035/osu035_stdcells.lib
# Map combinatorial cells, standard script
abc -exe /usr/local/bin/yosys-abc -liberty /usr/local/share/qflow/tech/osu035/osu035_stdcells.lib -script +strash;scorr;ifraig;retime,{D};strash;dch,-f;map,-M,1,{D}
flatten

clean -purge
# Cleanup
opt
clean
rename -enumerate
write_blif  -buf BUFX2 A Y cpu_mapped.blif
